{"pages":[{"title":"","text":"DemoHere you can see some interesting demos.","link":"/blog/index.html"},{"title":"About Us","text":"The UOW NLP group conducts research in natural language processing, with the goal of making computers understand and use human language effectively. We develop novel algorithms, design new frameworks and investigate theoretical foundations tThe UOW NLP group is for high quality research in Natural Language Processing (NLP), with the ultimate goal of enabling computers to understand and analyse human language effectively. We focus on theory development, novel techniques and effective solutions of NLP in broad domains, such as Education, Law, Healthcare and Finance management.Our efforts cover the practical framework for question answering, knowledge representation &amp; reasoning, document retrial, Chatbot (dialogue systems).","link":"/about/index.html"},{"title":"","text":"Facult @media (min-width: 769px) { .personal .personal_img, .personal .personal_message{ float:left; } } @media (max-width: 769px) { .personal{ text-align:center; } } .personal .personal_img img { height:250px; width:250px; } .personal .personal_message{ padding: 50px 30px; } .personal .personal_message p{ margin:0; } Yang, Jack Dr Lecturer Faculty of Engineering and Information Sciences Lecturer - School of Computing and Information Technology","link":"/people/index.html"},{"title":"Publications","text":"","link":"/publications/index.html"}],"posts":[{"title":"DOCUMENT RETRIEVAL","text":"","link":"/2022/05/02/document-retrieval/"},{"title":"Sentence Label","text":"This is a software for multiple choice. You can use it to tag the sentences in the article that support the correct answer. Its detailed tutorial is here.","link":"/2022/05/10/sentence-label/"},{"title":"","text":"Websitehttp://isee.s3-website-ap-southeast-2.amazonaws.com/ Developed with the latest technologyiSee allows the user to experience, use and be entertained with the machine learning and natural language generation technology. Natural Language Generation (NLG)The power of NLG allows present data regarding a photo to be transformed into comprehensive sentences constructed from keywords in such a way that can be read and understood by any human. Social Media IntegrationWith iSee’s social media integration, you can submit all photos and pertinent descriptive information to most social media platforms at the tap of a button. Supported platforms include Facebook, Instagram and Twitter, to name just a few. Object DetectionObject detection using the latest technology by Google (ML Kit) and Firebase allows for submitted photos to be read and understood by AI components so that accurate descriptions regarding the photo content can be generated.","link":"/2022/05/01/i-see/"}],"tags":[{"name":"Demo","slug":"Demo","link":"/tags/Demo/"}],"categories":[]}