{"pages":[{"title":"About Us","text":"We, WOW NLP, is a group of NLPer conducts research in natural language processing from University of Wollongong (UOW), to enable computers understanding and using human language effectively. We focus on theory development, novel techniques and effective solutions of NLP in broad domains, such as Education, Law, Healthcare and Finance management. Specifically, our efforts cover the practical framework for question answering, knowledge graph, representation &amp; reasoning, document retrieval, Chatbot (dialogue systems).","link":"/about/index.html"},{"title":"","text":"DemoHere you can see some interesting demos.","link":"/blog/index.html"},{"title":"","text":"People @media (min-width: 769px) { .personal .personal_img, .personal .personal_message{ float:left; } } @media (max-width: 769px) { .personal{ text-align:center; } } .personal .personal_img img { height:250px; width:250px; } .personal .personal_message{ padding: 50px 30px; } .personal .personal_message p{ margin:0; } Dr Jack Yang School of Computing and Information Technology Faculty of Engineering and Information Sciences, UOW Drop an email if you are interested in text mining, natural language processing, and related applications.","link":"/people/index.html"},{"title":"Publications","text":"","link":"/publications/index.html"}],"posts":[{"title":"Document retrieval","text":"This demo is implemented using Elasticsearch + SquAD 1.1 dataset (with approximately 89,717 processed documents). The responding time is ~7ms.","link":"/2022/06/12/document-retrieval/"},{"title":"","text":"iSeehttp://isee.s3-website-ap-southeast-2.amazonaws.com/ Developed with the latest technologyiSee allows the user to experience, use and be entertained with the machine learning and natural language generation technology. Natural Language Generation (NLG)The power of NLG allows present data regarding a photo to be transformed into comprehensive sentences constructed from keywords in such a way that can be read and understood by any human. Social Media IntegrationWith iSee’s social media integration, you can submit all photos and pertinent descriptive information to most social media platforms at the tap of a button. Supported platforms include Facebook, Instagram and Twitter, to name just a few. Object DetectionObject detection using the latest technology by Google (ML Kit) and Firebase allows for submitted photos to be read and understood by AI components so that accurate descriptions regarding the photo content can be generated. credited to CSIT321 student project.","link":"/2022/06/12/i-see/"},{"title":"Sentence annotation tool","text":"This is an annotation tool for masking evidence sentences for multiple choice. That is, one can use to tag key sentences in the article that supporting correct answer(s). More detailed tutorial is here.","link":"/2022/06/12/sentence-label/"}],"tags":[{"name":"Demo","slug":"Demo","link":"/tags/Demo/"}],"categories":[]}